#+TITLE:  Backup via rsync
#+AUTHOR: Timo Lassmann
#+EMAIL:  timo.lassmann@telethonkids.org.au
#+DATE:   2018-10-04
#+LATEX_CLASS: report
#+OPTIONS:  toc:nil
#+OPTIONS: H:4
#+LATEX_CMD: xelatex

* Testing 


  #+BEGIN_SRC sh 
    targets=($HOME/code $HOME/work)

    test_function()
    {

        for item in ${targets[*]}
        do
        
            printf "rsync -a --progress  %s  $HOME/rsync/daily \n" $item
        done
    }
    test_function
  #+END_SRC

  #+RESULTS:
| rsync | -a | --progress | /home/user/code | /home/user/rsync/daily |
| rsync | -a | --progress | /home/user/work | /home/user/rsync/daily |

